hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_qeiv2_regs.h
/*
 * CYCLE0FEN (RW)
 *
 */
#define QEIV2_DMAEN_CYCLE0FEN_MASK (0x800000UL)
#define QEIV2_DMAEN_CYCLE0FEN_SHIFT (23U)
#define QEIV2_DMAEN_CYCLE0FEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_CYCLE0FEN_SHIFT) & QEIV2_DMAEN_CYCLE0FEN_MASK)
#define QEIV2_DMAEN_CYCLE0FEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_CYCLE0FEN_MASK) >> QEIV2_DMAEN_CYCLE0FEN_SHIFT)

/*
 * CYCLE1FEN (RW)
 *
 */
#define QEIV2_DMAEN_CYCLE1FEN_MASK (0x400000UL)
#define QEIV2_DMAEN_CYCLE1FEN_SHIFT (22U)
#define QEIV2_DMAEN_CYCLE1FEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_CYCLE1FEN_SHIFT) & QEIV2_DMAEN_CYCLE1FEN_MASK)
#define QEIV2_DMAEN_CYCLE1FEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_CYCLE1FEN_MASK) >> QEIV2_DMAEN_CYCLE1FEN_SHIFT)

/*
 * PULSE0FEN (RW)
 *
 */
#define QEIV2_DMAEN_PULSE0FEN_MASK (0x200000UL)
#define QEIV2_DMAEN_PULSE0FEN_SHIFT (21U)
#define QEIV2_DMAEN_PULSE0FEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_PULSE0FEN_SHIFT) & QEIV2_DMAEN_PULSE0FEN_MASK)
#define QEIV2_DMAEN_PULSE0FEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_PULSE0FEN_MASK) >> QEIV2_DMAEN_PULSE0FEN_SHIFT)

/*
 * PULSE1FEN (RW)
 *
 */
#define QEIV2_DMAEN_PULSE1FEN_MASK (0x100000UL)
#define QEIV2_DMAEN_PULSE1FEN_SHIFT (20U)
#define QEIV2_DMAEN_PULSE1FEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_PULSE1FEN_SHIFT) & QEIV2_DMAEN_PULSE1FEN_MASK)
#define QEIV2_DMAEN_PULSE1FEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_PULSE1FEN_MASK) >> QEIV2_DMAEN_PULSE1FEN_SHIFT)

/*
 * HOME2FEN (RW)
 *
 */
#define QEIV2_DMAEN_HOME2FEN_MASK (0x80000UL)
#define QEIV2_DMAEN_HOME2FEN_SHIFT (19U)
#define QEIV2_DMAEN_HOME2FEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_HOME2FEN_SHIFT) & QEIV2_DMAEN_HOME2FEN_MASK)
#define QEIV2_DMAEN_HOME2FEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_HOME2FEN_MASK) >> QEIV2_DMAEN_HOME2FEN_SHIFT)

/*
 * FAULTFEN (RW)
 *
 */
#define QEIV2_DMAEN_FAULTFEN_MASK (0x40000UL)
#define QEIV2_DMAEN_FAULTFEN_SHIFT (18U)
#define QEIV2_DMAEN_FAULTFEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_FAULTFEN_SHIFT) & QEIV2_DMAEN_FAULTFEN_MASK)
#define QEIV2_DMAEN_FAULTFEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_FAULTFEN_MASK) >> QEIV2_DMAEN_FAULTFEN_SHIFT)

/* Bitfield definition for register: SR */
/*
 * WDGF (RW)
 *
 * watchdog flag
 */
#define QEIV2_SR_WDGF_MASK (0x80000000UL)
#define QEIV2_SR_WDGF_SHIFT (31U)
#define QEIV2_SR_WDGF_SET(x) (((uint32_t)(x) << QEIV2_SR_WDGF_SHIFT) & QEIV2_SR_WDGF_MASK)
#define QEIV2_SR_WDGF_GET(x) (((uint32_t)(x) & QEIV2_SR_WDGF_MASK) >> QEIV2_SR_WDGF_SHIFT)

/*
 * HOMEF (RW)
 *
 * home flag
 */
#define QEIV2_SR_HOMEF_MASK (0x40000000UL)
#define QEIV2_SR_HOMEF_SHIFT (30U)
#define QEIV2_SR_HOMEF_SET(x) (((uint32_t)(x) << QEIV2_SR_HOMEF_SHIFT) & QEIV2_SR_HOMEF_MASK)
#define QEIV2_SR_HOMEF_GET(x) (((uint32_t)(x) & QEIV2_SR_HOMEF_MASK) >> QEIV2_SR_HOMEF_SHIFT)

/*
 * POSCMPF (RW)
 *
 * postion compare match flag
 */
#define QEIV2_SR_POSCMPF_MASK (0x20000000UL)
#define QEIV2_SR_POSCMPF_SHIFT (29U)
#define QEIV2_SR_POSCMPF_SET(x) (((uint32_t)(x) << QEIV2_SR_POSCMPF_SHIFT) & QEIV2_SR_POSCMPF_MASK)
#define QEIV2_SR_POSCMPF_GET(x) (((uint32_t)(x) & QEIV2_SR_POSCMPF_MASK) >> QEIV2_SR_POSCMPF_SHIFT)

/*
 * ZPHF (RW)
 *
 * z input flag
 */
#define QEIV2_SR_ZPHF_MASK (0x10000000UL)
#define QEIV2_SR_ZPHF_SHIFT (28U)
#define QEIV2_SR_ZPHF_SET(x) (((uint32_t)(x) << QEIV2_SR_ZPHF_SHIFT) & QEIV2_SR_ZPHF_MASK)
#define QEIV2_SR_ZPHF_GET(x) (((uint32_t)(x) & QEIV2_SR_ZPHF_MASK) >> QEIV2_SR_ZPHF_SHIFT)

/*
 * ZMISSF (RW)
 *
 */
#define QEIV2_SR_ZMISSF_MASK (0x8000000UL)
#define QEIV2_SR_ZMISSF_SHIFT (27U)
#define QEIV2_SR_ZMISSF_SET(x) (((uint32_t)(x) << QEIV2_SR_ZMISSF_SHIFT) & QEIV2_SR_ZMISSF_MASK)
#define QEIV2_SR_ZMISSF_GET(x) (((uint32_t)(x) & QEIV2_SR_ZMISSF_MASK) >> QEIV2_SR_ZMISSF_SHIFT)

/*
 * WIDTHTMF (RW)
 *
 */
#define QEIV2_SR_WIDTHTMF_MASK (0x4000000UL)
#define QEIV2_SR_WIDTHTMF_SHIFT (26U)
#define QEIV2_SR_WIDTHTMF_SET(x) (((uint32_t)(x) << QEIV2_SR_WIDTHTMF_SHIFT) & QEIV2_SR_WIDTHTMF_MASK)
#define QEIV2_SR_WIDTHTMF_GET(x) (((uint32_t)(x) & QEIV2_SR_WIDTHTMF_MASK) >> QEIV2_SR_WIDTHTMF_SHIFT)

/*
 * POS2CMPF (RW)
 *
 */
#define QEIV2_SR_POS2CMPF_MASK (0x2000000UL)
#define QEIV2_SR_POS2CMPF_SHIFT (25U)
#define QEIV2_SR_POS2CMPF_SET(x) (((uint32_t)(x) << QEIV2_SR_POS2CMPF_SHIFT) & QEIV2_SR_POS2CMPF_MASK)
#define QEIV2_SR_POS2CMPF_GET(x) (((uint32_t)(x) & QEIV2_SR_POS2CMPF_MASK) >> QEIV2_SR_POS2CMPF_SHIFT)

/*
 * DIRCHGF (RW)
 *
 */
#define QEIV2_SR_DIRCHGF_MASK (0x1000000UL)
#define QEIV2_SR_DIRCHGF_SHIFT (24U)
#define QEIV2_SR_DIRCHGF_SET(x) (((uint32_t)(x) << QEIV2_SR_DIRCHGF_SHIFT) & QEIV2_SR_DIRCHGF_MASK)
#define QEIV2_SR_DIRCHGF_GET(x) (((uint32_t)(x) & QEIV2_SR_DIRCHGF_MASK) >> QEIV2_SR_DIRCHGF_SHIFT)

/*
 * CYCLE0F (RW)
 *
 */
#define QEIV2_SR_CYCLE0F_MASK (0x800000UL)
#define QEIV2_SR_CYCLE0F_SHIFT (23U)
#define QEIV2_SR_CYCLE0F_SET(x) (((uint32_t)(x) << QEIV2_SR_CYCLE0F_SHIFT) & QEIV2_SR_CYCLE0F_MASK)
#define QEIV2_SR_CYCLE0F_GET(x) (((uint32_t)(x) & QEIV2_SR_CYCLE0F_MASK) >> QEIV2_SR_CYCLE0F_SHIFT)

/*
 * CYCLE1F (RW)
 *
 */
#define QEIV2_SR_CYCLE1F_MASK (0x400000UL)
#define QEIV2_SR_CYCLE1F_SHIFT (22U)
#define QEIV2_SR_CYCLE1F_SET(x) (((uint32_t)(x) << QEIV2_SR_CYCLE1F_SHIFT) & QEIV2_SR_CYCLE1F_MASK)
#define QEIV2_SR_CYCLE1F_GET(x) (((uint32_t)(x) & QEIV2_SR_CYCLE1F_MASK) >> QEIV2_SR_CYCLE1F_SHIFT)

/*
 * PULSE0F (RW)
 *
 */
#define QEIV2_SR_PULSE0F_MASK (0x200000UL)
#define QEIV2_SR_PULSE0F_SHIFT (21U)
#define QEIV2_SR_PULSE0F_SET(x) (((uint32_t)(x) << QEIV2_SR_PULSE0F_SHIFT) & QEIV2_SR_PULSE0F_MASK)
#define QEIV2_SR_PULSE0F_GET(x) (((uint32_t)(x) & QEIV2_SR_PULSE0F_MASK) >> QEIV2_SR_PULSE0F_SHIFT)

/*
 * PULSE1F (RW)
 *
 */
#define QEIV2_SR_PULSE1F_MASK (0x100000UL)
#define QEIV2_SR_PULSE1F_SHIFT (20U)
#define QEIV2_SR_PULSE1F_SET(x) (((uint32_t)(x) << QEIV2_SR_PULSE1F_SHIFT) & QEIV2_SR_PULSE1F_MASK)
#define QEIV2_SR_PULSE1F_GET(x) (((uint32_t)(x) & QEIV2_SR_PULSE1F_MASK) >> QEIV2_SR_PULSE1F_SHIFT)

/*
 * HOME2F (RW)
 *
 */
#define QEIV2_SR_HOME2F_MASK (0x80000UL)
#define QEIV2_SR_HOME2F_SHIFT (19U)
#define QEIV2_SR_HOME2F_SET(x) (((uint32_t)(x) << QEIV2_SR_HOME2F_SHIFT) & QEIV2_SR_HOME2F_MASK)
#define QEIV2_SR_HOME2F_GET(x) (((uint32_t)(x) & QEIV2_SR_HOME2F_MASK) >> QEIV2_SR_HOME2F_SHIFT)

