hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_qeiv2_regs.h
/*
 * NEGEDGE_EN (RW)
 *
 * bit4:  negedge enable
 * bit3:  posedge enable
 * bit2:  W in hal enable
 * bit1:  signal b(or V in hal) enable
 * bit0:  signal a(or U in hal) enable
 * such as:
 * 01001:  use posedge A
 * 11010:  use both edge of signal B
 * 11111:  use both edge of all HAL siganls
 */
#define QEIV2_QEI_CFG_NEGEDGE_EN_MASK (0x10U)
#define QEIV2_QEI_CFG_NEGEDGE_EN_SHIFT (4U)
#define QEIV2_QEI_CFG_NEGEDGE_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_NEGEDGE_EN_SHIFT) & QEIV2_QEI_CFG_NEGEDGE_EN_MASK)
#define QEIV2_QEI_CFG_NEGEDGE_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_NEGEDGE_EN_MASK) >> QEIV2_QEI_CFG_NEGEDGE_EN_SHIFT)

/*
 * POSIDGE_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_POSIDGE_EN_MASK (0x8U)
#define QEIV2_QEI_CFG_POSIDGE_EN_SHIFT (3U)
#define QEIV2_QEI_CFG_POSIDGE_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_POSIDGE_EN_SHIFT) & QEIV2_QEI_CFG_POSIDGE_EN_MASK)
#define QEIV2_QEI_CFG_POSIDGE_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_POSIDGE_EN_MASK) >> QEIV2_QEI_CFG_POSIDGE_EN_SHIFT)

/*
 * SIGZ_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_SIGZ_EN_MASK (0x4U)
#define QEIV2_QEI_CFG_SIGZ_EN_SHIFT (2U)
#define QEIV2_QEI_CFG_SIGZ_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SIGZ_EN_SHIFT) & QEIV2_QEI_CFG_SIGZ_EN_MASK)
#define QEIV2_QEI_CFG_SIGZ_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SIGZ_EN_MASK) >> QEIV2_QEI_CFG_SIGZ_EN_SHIFT)

/*
 * SIGB_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_SIGB_EN_MASK (0x2U)
#define QEIV2_QEI_CFG_SIGB_EN_SHIFT (1U)
#define QEIV2_QEI_CFG_SIGB_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SIGB_EN_SHIFT) & QEIV2_QEI_CFG_SIGB_EN_MASK)
#define QEIV2_QEI_CFG_SIGB_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SIGB_EN_MASK) >> QEIV2_QEI_CFG_SIGB_EN_SHIFT)

/*
 * SIGA_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_SIGA_EN_MASK (0x1U)
#define QEIV2_QEI_CFG_SIGA_EN_SHIFT (0U)
#define QEIV2_QEI_CFG_SIGA_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SIGA_EN_SHIFT) & QEIV2_QEI_CFG_SIGA_EN_MASK)
#define QEIV2_QEI_CFG_SIGA_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SIGA_EN_MASK) >> QEIV2_QEI_CFG_SIGA_EN_SHIFT)

/* Bitfield definition for register: PULSE0_NUM */
/*
 * PULSE0_NUM (RW)
 *
 * for speed detection, will count the cycle number for configed pulse_num
 */
#define QEIV2_PULSE0_NUM_PULSE0_NUM_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE0_NUM_PULSE0_NUM_SHIFT (0U)
#define QEIV2_PULSE0_NUM_PULSE0_NUM_SET(x) (((uint32_t)(x) << QEIV2_PULSE0_NUM_PULSE0_NUM_SHIFT) & QEIV2_PULSE0_NUM_PULSE0_NUM_MASK)
#define QEIV2_PULSE0_NUM_PULSE0_NUM_GET(x) (((uint32_t)(x) & QEIV2_PULSE0_NUM_PULSE0_NUM_MASK) >> QEIV2_PULSE0_NUM_PULSE0_NUM_SHIFT)

/* Bitfield definition for register: PULSE1_NUM */
/*
 * PULSE1_NUM (RW)
 *
 */
#define QEIV2_PULSE1_NUM_PULSE1_NUM_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE1_NUM_PULSE1_NUM_SHIFT (0U)
#define QEIV2_PULSE1_NUM_PULSE1_NUM_SET(x) (((uint32_t)(x) << QEIV2_PULSE1_NUM_PULSE1_NUM_SHIFT) & QEIV2_PULSE1_NUM_PULSE1_NUM_MASK)
#define QEIV2_PULSE1_NUM_PULSE1_NUM_GET(x) (((uint32_t)(x) & QEIV2_PULSE1_NUM_PULSE1_NUM_MASK) >> QEIV2_PULSE1_NUM_PULSE1_NUM_SHIFT)

/* Bitfield definition for register: CYCLE0_CNT */
/*
 * CYCLE0_CNT (RO)
 *
 */
#define QEIV2_CYCLE0_CNT_CYCLE0_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE0_CNT_CYCLE0_CNT_SHIFT (0U)
#define QEIV2_CYCLE0_CNT_CYCLE0_CNT_GET(x) (((uint32_t)(x) & QEIV2_CYCLE0_CNT_CYCLE0_CNT_MASK) >> QEIV2_CYCLE0_CNT_CYCLE0_CNT_SHIFT)

/* Bitfield definition for register: CYCLE0PULSE_CNT */
/*
 * CYCLE0PULSE_CNT (RO)
 *
 */
#define QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_SHIFT (0U)
#define QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_GET(x) (((uint32_t)(x) & QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_MASK) >> QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_SHIFT)

/* Bitfield definition for register: CYCLE1_CNT */
/*
 * CYCLE1_CNT (RO)
 *
 */
#define QEIV2_CYCLE1_CNT_CYCLE1_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE1_CNT_CYCLE1_CNT_SHIFT (0U)
#define QEIV2_CYCLE1_CNT_CYCLE1_CNT_GET(x) (((uint32_t)(x) & QEIV2_CYCLE1_CNT_CYCLE1_CNT_MASK) >> QEIV2_CYCLE1_CNT_CYCLE1_CNT_SHIFT)

/* Bitfield definition for register: CYCLE1PULSE_CNT */
/*
 * CYCLE1PULSE_CNT (RO)
 *
 */
#define QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_SHIFT (0U)
#define QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_GET(x) (((uint32_t)(x) & QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_MASK) >> QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_SHIFT)

/* Bitfield definition for register: CYCLE0_SNAP0 */
/*
 * CYCLE0_SNAP0 (RO)
 *
 */
#define QEIV2_CYCLE0_SNAP0_CYCLE0_SNAP0_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE0_SNAP0_CYCLE0_SNAP0_SHIFT (0U)
#define QEIV2_CYCLE0_SNAP0_CYCLE0_SNAP0_GET(x) (((uint32_t)(x) & QEIV2_CYCLE0_SNAP0_CYCLE0_SNAP0_MASK) >> QEIV2_CYCLE0_SNAP0_CYCLE0_SNAP0_SHIFT)

/* Bitfield definition for register: CYCLE0_SNAP1 */
/*
 * CYCLE0_SNAP1 (RO)
 *
 */
#define QEIV2_CYCLE0_SNAP1_CYCLE0_SNAP1_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE0_SNAP1_CYCLE0_SNAP1_SHIFT (0U)
#define QEIV2_CYCLE0_SNAP1_CYCLE0_SNAP1_GET(x) (((uint32_t)(x) & QEIV2_CYCLE0_SNAP1_CYCLE0_SNAP1_MASK) >> QEIV2_CYCLE0_SNAP1_CYCLE0_SNAP1_SHIFT)

/* Bitfield definition for register: CYCLE1_SNAP0 */
/*
 * CYCLE1_SNAP0 (RO)
 *
 */
#define QEIV2_CYCLE1_SNAP0_CYCLE1_SNAP0_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE1_SNAP0_CYCLE1_SNAP0_SHIFT (0U)
#define QEIV2_CYCLE1_SNAP0_CYCLE1_SNAP0_GET(x) (((uint32_t)(x) & QEIV2_CYCLE1_SNAP0_CYCLE1_SNAP0_MASK) >> QEIV2_CYCLE1_SNAP0_CYCLE1_SNAP0_SHIFT)

/* Bitfield definition for register: CYCLE1_SNAP1 */
/*
 * CYCLE1_SNAP1 (RO)
 *
 */
#define QEIV2_CYCLE1_SNAP1_CYCLE1_SNAP1_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE1_SNAP1_CYCLE1_SNAP1_SHIFT (0U)
#define QEIV2_CYCLE1_SNAP1_CYCLE1_SNAP1_GET(x) (((uint32_t)(x) & QEIV2_CYCLE1_SNAP1_CYCLE1_SNAP1_MASK) >> QEIV2_CYCLE1_SNAP1_CYCLE1_SNAP1_SHIFT)

/* Bitfield definition for register: CYCLE0_NUM */
/*
 * CYCLE0_NUM (RW)
 *
 */
#define QEIV2_CYCLE0_NUM_CYCLE0_NUM_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE0_NUM_CYCLE0_NUM_SHIFT (0U)
#define QEIV2_CYCLE0_NUM_CYCLE0_NUM_SET(x) (((uint32_t)(x) << QEIV2_CYCLE0_NUM_CYCLE0_NUM_SHIFT) & QEIV2_CYCLE0_NUM_CYCLE0_NUM_MASK)
#define QEIV2_CYCLE0_NUM_CYCLE0_NUM_GET(x) (((uint32_t)(x) & QEIV2_CYCLE0_NUM_CYCLE0_NUM_MASK) >> QEIV2_CYCLE0_NUM_CYCLE0_NUM_SHIFT)

/* Bitfield definition for register: CYCLE1_NUM */
/*
 * CYCLE1_NUM (RW)
 *
 */
#define QEIV2_CYCLE1_NUM_CYCLE1_NUM_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE1_NUM_CYCLE1_NUM_SHIFT (0U)
#define QEIV2_CYCLE1_NUM_CYCLE1_NUM_SET(x) (((uint32_t)(x) << QEIV2_CYCLE1_NUM_CYCLE1_NUM_SHIFT) & QEIV2_CYCLE1_NUM_CYCLE1_NUM_MASK)
#define QEIV2_CYCLE1_NUM_CYCLE1_NUM_GET(x) (((uint32_t)(x) & QEIV2_CYCLE1_NUM_CYCLE1_NUM_MASK) >> QEIV2_CYCLE1_NUM_CYCLE1_NUM_SHIFT)

/* Bitfield definition for register: PULSE0_CNT */
/*
 * PULSE0_CNT (RO)
 *
 */
#define QEIV2_PULSE0_CNT_PULSE0_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE0_CNT_PULSE0_CNT_SHIFT (0U)
#define QEIV2_PULSE0_CNT_PULSE0_CNT_GET(x) (((uint32_t)(x) & QEIV2_PULSE0_CNT_PULSE0_CNT_MASK) >> QEIV2_PULSE0_CNT_PULSE0_CNT_SHIFT)

/* Bitfield definition for register: PULSE0CYCLE_CNT */
/*
 * PULSE0CYCLE_CNT (RO)
 *
 */
#define QEIV2_PULSE0CYCLE_CNT_PULSE0CYCLE_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE0CYCLE_CNT_PULSE0CYCLE_CNT_SHIFT (0U)
#define QEIV2_PULSE0CYCLE_CNT_PULSE0CYCLE_CNT_GET(x) (((uint32_t)(x) & QEIV2_PULSE0CYCLE_CNT_PULSE0CYCLE_CNT_MASK) >> QEIV2_PULSE0CYCLE_CNT_PULSE0CYCLE_CNT_SHIFT)

/* Bitfield definition for register: PULSE1_CNT */
/*
 * PULSE1_CNT (RO)
 *
 */
#define QEIV2_PULSE1_CNT_PULSE1_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE1_CNT_PULSE1_CNT_SHIFT (0U)
#define QEIV2_PULSE1_CNT_PULSE1_CNT_GET(x) (((uint32_t)(x) & QEIV2_PULSE1_CNT_PULSE1_CNT_MASK) >> QEIV2_PULSE1_CNT_PULSE1_CNT_SHIFT)

/* Bitfield definition for register: PULSE1CYCLE_CNT */
/*
 * PULSE1CYCLE_CNT (RO)
 *
 */
#define QEIV2_PULSE1CYCLE_CNT_PULSE1CYCLE_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE1CYCLE_CNT_PULSE1CYCLE_CNT_SHIFT (0U)
#define QEIV2_PULSE1CYCLE_CNT_PULSE1CYCLE_CNT_GET(x) (((uint32_t)(x) & QEIV2_PULSE1CYCLE_CNT_PULSE1CYCLE_CNT_MASK) >> QEIV2_PULSE1CYCLE_CNT_PULSE1CYCLE_CNT_SHIFT)

/* Bitfield definition for register: PULSE0_SNAP0 */
/*
 * PULSE0_SNAP0 (RO)
 *
 */
#define QEIV2_PULSE0_SNAP0_PULSE0_SNAP0_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE0_SNAP0_PULSE0_SNAP0_SHIFT (0U)
#define QEIV2_PULSE0_SNAP0_PULSE0_SNAP0_GET(x) (((uint32_t)(x) & QEIV2_PULSE0_SNAP0_PULSE0_SNAP0_MASK) >> QEIV2_PULSE0_SNAP0_PULSE0_SNAP0_SHIFT)

/* Bitfield definition for register: PULSE0CYCLE_SNAP0 */
/*
 * PULSE0CYCLE_SNAP0 (RO)
 *
 */
#define QEIV2_PULSE0CYCLE_SNAP0_PULSE0CYCLE_SNAP0_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE0CYCLE_SNAP0_PULSE0CYCLE_SNAP0_SHIFT (0U)
#define QEIV2_PULSE0CYCLE_SNAP0_PULSE0CYCLE_SNAP0_GET(x) (((uint32_t)(x) & QEIV2_PULSE0CYCLE_SNAP0_PULSE0CYCLE_SNAP0_MASK) >> QEIV2_PULSE0CYCLE_SNAP0_PULSE0CYCLE_SNAP0_SHIFT)

/* Bitfield definition for register: PULSE0_SNAP1 */
/*
 * PULSE0_SNAP1 (RO)
 *
 */
#define QEIV2_PULSE0_SNAP1_PULSE0_SNAP1_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE0_SNAP1_PULSE0_SNAP1_SHIFT (0U)
#define QEIV2_PULSE0_SNAP1_PULSE0_SNAP1_GET(x) (((uint32_t)(x) & QEIV2_PULSE0_SNAP1_PULSE0_SNAP1_MASK) >> QEIV2_PULSE0_SNAP1_PULSE0_SNAP1_SHIFT)

