hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_qeiv2_regs.h
/* Bitfield definition for register: PULSE0CYCLE_SNAP1 */
/*
 * PULSE0CYCLE_SNAP1 (RO)
 *
 */
#define QEIV2_PULSE0CYCLE_SNAP1_PULSE0CYCLE_SNAP1_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE0CYCLE_SNAP1_PULSE0CYCLE_SNAP1_SHIFT (0U)
#define QEIV2_PULSE0CYCLE_SNAP1_PULSE0CYCLE_SNAP1_GET(x) (((uint32_t)(x) & QEIV2_PULSE0CYCLE_SNAP1_PULSE0CYCLE_SNAP1_MASK) >> QEIV2_PULSE0CYCLE_SNAP1_PULSE0CYCLE_SNAP1_SHIFT)

/* Bitfield definition for register: PULSE1_SNAP0 */
/*
 * PULSE1_SNAP0 (RO)
 *
 */
#define QEIV2_PULSE1_SNAP0_PULSE1_SNAP0_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE1_SNAP0_PULSE1_SNAP0_SHIFT (0U)
#define QEIV2_PULSE1_SNAP0_PULSE1_SNAP0_GET(x) (((uint32_t)(x) & QEIV2_PULSE1_SNAP0_PULSE1_SNAP0_MASK) >> QEIV2_PULSE1_SNAP0_PULSE1_SNAP0_SHIFT)

/* Bitfield definition for register: PULSE1CYCLE_SNAP0 */
/*
 * PULSE1CYCLE_SNAP0 (RO)
 *
 */
#define QEIV2_PULSE1CYCLE_SNAP0_PULSE1CYCLE_SNAP0_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE1CYCLE_SNAP0_PULSE1CYCLE_SNAP0_SHIFT (0U)
#define QEIV2_PULSE1CYCLE_SNAP0_PULSE1CYCLE_SNAP0_GET(x) (((uint32_t)(x) & QEIV2_PULSE1CYCLE_SNAP0_PULSE1CYCLE_SNAP0_MASK) >> QEIV2_PULSE1CYCLE_SNAP0_PULSE1CYCLE_SNAP0_SHIFT)

/* Bitfield definition for register: PULSE1_SNAP1 */
/*
 * PULSE1_SNAP1 (RO)
 *
 */
#define QEIV2_PULSE1_SNAP1_PULSE1_SNAP1_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE1_SNAP1_PULSE1_SNAP1_SHIFT (0U)
#define QEIV2_PULSE1_SNAP1_PULSE1_SNAP1_GET(x) (((uint32_t)(x) & QEIV2_PULSE1_SNAP1_PULSE1_SNAP1_MASK) >> QEIV2_PULSE1_SNAP1_PULSE1_SNAP1_SHIFT)

/* Bitfield definition for register: PULSE1CYCLE_SNAP1 */
/*
 * PULSE1CYCLE_SNAP1 (RO)
 *
 */
#define QEIV2_PULSE1CYCLE_SNAP1_PULSE1CYCLE_SNAP1_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE1CYCLE_SNAP1_PULSE1CYCLE_SNAP1_SHIFT (0U)
#define QEIV2_PULSE1CYCLE_SNAP1_PULSE1CYCLE_SNAP1_GET(x) (((uint32_t)(x) & QEIV2_PULSE1CYCLE_SNAP1_PULSE1CYCLE_SNAP1_MASK) >> QEIV2_PULSE1CYCLE_SNAP1_PULSE1CYCLE_SNAP1_SHIFT)

/* Bitfield definition for register: ADCX_CFG0 */
/*
 * X_ADCSEL (RW)
 *
 */
#define QEIV2_ADCX_CFG0_X_ADCSEL_MASK (0x100U)
#define QEIV2_ADCX_CFG0_X_ADCSEL_SHIFT (8U)
#define QEIV2_ADCX_CFG0_X_ADCSEL_SET(x) (((uint32_t)(x) << QEIV2_ADCX_CFG0_X_ADCSEL_SHIFT) & QEIV2_ADCX_CFG0_X_ADCSEL_MASK)
#define QEIV2_ADCX_CFG0_X_ADCSEL_GET(x) (((uint32_t)(x) & QEIV2_ADCX_CFG0_X_ADCSEL_MASK) >> QEIV2_ADCX_CFG0_X_ADCSEL_SHIFT)

/*
 * X_ADC_ENABLE (RW)
 *
 */
#define QEIV2_ADCX_CFG0_X_ADC_ENABLE_MASK (0x80U)
#define QEIV2_ADCX_CFG0_X_ADC_ENABLE_SHIFT (7U)
#define QEIV2_ADCX_CFG0_X_ADC_ENABLE_SET(x) (((uint32_t)(x) << QEIV2_ADCX_CFG0_X_ADC_ENABLE_SHIFT) & QEIV2_ADCX_CFG0_X_ADC_ENABLE_MASK)
#define QEIV2_ADCX_CFG0_X_ADC_ENABLE_GET(x) (((uint32_t)(x) & QEIV2_ADCX_CFG0_X_ADC_ENABLE_MASK) >> QEIV2_ADCX_CFG0_X_ADC_ENABLE_SHIFT)

/*
 * X_CHAN (RW)
 *
 */
#define QEIV2_ADCX_CFG0_X_CHAN_MASK (0x1FU)
#define QEIV2_ADCX_CFG0_X_CHAN_SHIFT (0U)
#define QEIV2_ADCX_CFG0_X_CHAN_SET(x) (((uint32_t)(x) << QEIV2_ADCX_CFG0_X_CHAN_SHIFT) & QEIV2_ADCX_CFG0_X_CHAN_MASK)
#define QEIV2_ADCX_CFG0_X_CHAN_GET(x) (((uint32_t)(x) & QEIV2_ADCX_CFG0_X_CHAN_MASK) >> QEIV2_ADCX_CFG0_X_CHAN_SHIFT)

/* Bitfield definition for register: ADCX_CFG1 */
/*
 * X_PARAM1 (RW)
 *
 */
#define QEIV2_ADCX_CFG1_X_PARAM1_MASK (0xFFFF0000UL)
#define QEIV2_ADCX_CFG1_X_PARAM1_SHIFT (16U)
#define QEIV2_ADCX_CFG1_X_PARAM1_SET(x) (((uint32_t)(x) << QEIV2_ADCX_CFG1_X_PARAM1_SHIFT) & QEIV2_ADCX_CFG1_X_PARAM1_MASK)
#define QEIV2_ADCX_CFG1_X_PARAM1_GET(x) (((uint32_t)(x) & QEIV2_ADCX_CFG1_X_PARAM1_MASK) >> QEIV2_ADCX_CFG1_X_PARAM1_SHIFT)

/*
 * X_PARAM0 (RW)
 *
 */
#define QEIV2_ADCX_CFG1_X_PARAM0_MASK (0xFFFFU)
#define QEIV2_ADCX_CFG1_X_PARAM0_SHIFT (0U)
#define QEIV2_ADCX_CFG1_X_PARAM0_SET(x) (((uint32_t)(x) << QEIV2_ADCX_CFG1_X_PARAM0_SHIFT) & QEIV2_ADCX_CFG1_X_PARAM0_MASK)
#define QEIV2_ADCX_CFG1_X_PARAM0_GET(x) (((uint32_t)(x) & QEIV2_ADCX_CFG1_X_PARAM0_MASK) >> QEIV2_ADCX_CFG1_X_PARAM0_SHIFT)

/* Bitfield definition for register: ADCX_CFG2 */
/*
 * X_OFFSET (RW)
 *
 */
#define QEIV2_ADCX_CFG2_X_OFFSET_MASK (0xFFFFFFFFUL)
#define QEIV2_ADCX_CFG2_X_OFFSET_SHIFT (0U)
#define QEIV2_ADCX_CFG2_X_OFFSET_SET(x) (((uint32_t)(x) << QEIV2_ADCX_CFG2_X_OFFSET_SHIFT) & QEIV2_ADCX_CFG2_X_OFFSET_MASK)
#define QEIV2_ADCX_CFG2_X_OFFSET_GET(x) (((uint32_t)(x) & QEIV2_ADCX_CFG2_X_OFFSET_MASK) >> QEIV2_ADCX_CFG2_X_OFFSET_SHIFT)

/* Bitfield definition for register: ADCY_CFG0 */
/*
 * Y_ADCSEL (RW)
 *
 */
#define QEIV2_ADCY_CFG0_Y_ADCSEL_MASK (0x100U)
#define QEIV2_ADCY_CFG0_Y_ADCSEL_SHIFT (8U)
#define QEIV2_ADCY_CFG0_Y_ADCSEL_SET(x) (((uint32_t)(x) << QEIV2_ADCY_CFG0_Y_ADCSEL_SHIFT) & QEIV2_ADCY_CFG0_Y_ADCSEL_MASK)
#define QEIV2_ADCY_CFG0_Y_ADCSEL_GET(x) (((uint32_t)(x) & QEIV2_ADCY_CFG0_Y_ADCSEL_MASK) >> QEIV2_ADCY_CFG0_Y_ADCSEL_SHIFT)

/*
 * Y_ADC_ENABLE (RW)
 *
 */
#define QEIV2_ADCY_CFG0_Y_ADC_ENABLE_MASK (0x80U)
#define QEIV2_ADCY_CFG0_Y_ADC_ENABLE_SHIFT (7U)
#define QEIV2_ADCY_CFG0_Y_ADC_ENABLE_SET(x) (((uint32_t)(x) << QEIV2_ADCY_CFG0_Y_ADC_ENABLE_SHIFT) & QEIV2_ADCY_CFG0_Y_ADC_ENABLE_MASK)
#define QEIV2_ADCY_CFG0_Y_ADC_ENABLE_GET(x) (((uint32_t)(x) & QEIV2_ADCY_CFG0_Y_ADC_ENABLE_MASK) >> QEIV2_ADCY_CFG0_Y_ADC_ENABLE_SHIFT)

/*
 * Y_CHAN (RW)
 *
 */
#define QEIV2_ADCY_CFG0_Y_CHAN_MASK (0x1FU)
#define QEIV2_ADCY_CFG0_Y_CHAN_SHIFT (0U)
#define QEIV2_ADCY_CFG0_Y_CHAN_SET(x) (((uint32_t)(x) << QEIV2_ADCY_CFG0_Y_CHAN_SHIFT) & QEIV2_ADCY_CFG0_Y_CHAN_MASK)
#define QEIV2_ADCY_CFG0_Y_CHAN_GET(x) (((uint32_t)(x) & QEIV2_ADCY_CFG0_Y_CHAN_MASK) >> QEIV2_ADCY_CFG0_Y_CHAN_SHIFT)

/* Bitfield definition for register: ADCY_CFG1 */
/*
 * Y_PARAM1 (RW)
 *
 */
#define QEIV2_ADCY_CFG1_Y_PARAM1_MASK (0xFFFF0000UL)
#define QEIV2_ADCY_CFG1_Y_PARAM1_SHIFT (16U)
#define QEIV2_ADCY_CFG1_Y_PARAM1_SET(x) (((uint32_t)(x) << QEIV2_ADCY_CFG1_Y_PARAM1_SHIFT) & QEIV2_ADCY_CFG1_Y_PARAM1_MASK)
#define QEIV2_ADCY_CFG1_Y_PARAM1_GET(x) (((uint32_t)(x) & QEIV2_ADCY_CFG1_Y_PARAM1_MASK) >> QEIV2_ADCY_CFG1_Y_PARAM1_SHIFT)

/*
 * Y_PARAM0 (RW)
 *
 */
#define QEIV2_ADCY_CFG1_Y_PARAM0_MASK (0xFFFFU)
#define QEIV2_ADCY_CFG1_Y_PARAM0_SHIFT (0U)
#define QEIV2_ADCY_CFG1_Y_PARAM0_SET(x) (((uint32_t)(x) << QEIV2_ADCY_CFG1_Y_PARAM0_SHIFT) & QEIV2_ADCY_CFG1_Y_PARAM0_MASK)
#define QEIV2_ADCY_CFG1_Y_PARAM0_GET(x) (((uint32_t)(x) & QEIV2_ADCY_CFG1_Y_PARAM0_MASK) >> QEIV2_ADCY_CFG1_Y_PARAM0_SHIFT)

