hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_qeiv2_regs.h
/* Bitfield definition for register: ADCY_CFG2 */
/*
 * Y_OFFSET (RW)
 *
 */
#define QEIV2_ADCY_CFG2_Y_OFFSET_MASK (0xFFFFFFFFUL)
#define QEIV2_ADCY_CFG2_Y_OFFSET_SHIFT (0U)
#define QEIV2_ADCY_CFG2_Y_OFFSET_SET(x) (((uint32_t)(x) << QEIV2_ADCY_CFG2_Y_OFFSET_SHIFT) & QEIV2_ADCY_CFG2_Y_OFFSET_MASK)
#define QEIV2_ADCY_CFG2_Y_OFFSET_GET(x) (((uint32_t)(x) & QEIV2_ADCY_CFG2_Y_OFFSET_MASK) >> QEIV2_ADCY_CFG2_Y_OFFSET_SHIFT)

/* Bitfield definition for register: CAL_CFG */
/*
 * XY_DELAY (RW)
 *
 * valid x/y delay, larger than this delay will be treated as invalid data.
 * Default 1.25us@200MHz;   max 80ms;
 */
#define QEIV2_CAL_CFG_XY_DELAY_MASK (0xFFFFFFUL)
#define QEIV2_CAL_CFG_XY_DELAY_SHIFT (0U)
#define QEIV2_CAL_CFG_XY_DELAY_SET(x) (((uint32_t)(x) << QEIV2_CAL_CFG_XY_DELAY_SHIFT) & QEIV2_CAL_CFG_XY_DELAY_MASK)
#define QEIV2_CAL_CFG_XY_DELAY_GET(x) (((uint32_t)(x) & QEIV2_CAL_CFG_XY_DELAY_MASK) >> QEIV2_CAL_CFG_XY_DELAY_SHIFT)

/* Bitfield definition for register: PHASE_PARAM */
/*
 * PHASE_PARAM (RW)
 *
 */
#define QEIV2_PHASE_PARAM_PHASE_PARAM_MASK (0xFFFFFFFFUL)
#define QEIV2_PHASE_PARAM_PHASE_PARAM_SHIFT (0U)
#define QEIV2_PHASE_PARAM_PHASE_PARAM_SET(x) (((uint32_t)(x) << QEIV2_PHASE_PARAM_PHASE_PARAM_SHIFT) & QEIV2_PHASE_PARAM_PHASE_PARAM_MASK)
#define QEIV2_PHASE_PARAM_PHASE_PARAM_GET(x) (((uint32_t)(x) & QEIV2_PHASE_PARAM_PHASE_PARAM_MASK) >> QEIV2_PHASE_PARAM_PHASE_PARAM_SHIFT)

/* Bitfield definition for register: ANGLE_ADJ */
/*
 * ANGLE_ADJ (RW)
 *
 */
#define QEIV2_ANGLE_ADJ_ANGLE_ADJ_MASK (0xFFFFFFFFUL)
#define QEIV2_ANGLE_ADJ_ANGLE_ADJ_SHIFT (0U)
#define QEIV2_ANGLE_ADJ_ANGLE_ADJ_SET(x) (((uint32_t)(x) << QEIV2_ANGLE_ADJ_ANGLE_ADJ_SHIFT) & QEIV2_ANGLE_ADJ_ANGLE_ADJ_MASK)
#define QEIV2_ANGLE_ADJ_ANGLE_ADJ_GET(x) (((uint32_t)(x) & QEIV2_ANGLE_ADJ_ANGLE_ADJ_MASK) >> QEIV2_ANGLE_ADJ_ANGLE_ADJ_SHIFT)

/* Bitfield definition for register: POS_THRESHOLD */
/*
 * POS_THRESHOLD (RW)
 *
 */
#define QEIV2_POS_THRESHOLD_POS_THRESHOLD_MASK (0xFFFFFFFFUL)
#define QEIV2_POS_THRESHOLD_POS_THRESHOLD_SHIFT (0U)
#define QEIV2_POS_THRESHOLD_POS_THRESHOLD_SET(x) (((uint32_t)(x) << QEIV2_POS_THRESHOLD_POS_THRESHOLD_SHIFT) & QEIV2_POS_THRESHOLD_POS_THRESHOLD_MASK)
#define QEIV2_POS_THRESHOLD_POS_THRESHOLD_GET(x) (((uint32_t)(x) & QEIV2_POS_THRESHOLD_POS_THRESHOLD_MASK) >> QEIV2_POS_THRESHOLD_POS_THRESHOLD_SHIFT)

/* Bitfield definition for register array: UVW_POS */
/*
 * UVW_POS0 (RW)
 *
 */
#define QEIV2_UVW_POS_UVW_POS0_MASK (0xFFFFFFFFUL)
#define QEIV2_UVW_POS_UVW_POS0_SHIFT (0U)
#define QEIV2_UVW_POS_UVW_POS0_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_UVW_POS0_SHIFT) & QEIV2_UVW_POS_UVW_POS0_MASK)
#define QEIV2_UVW_POS_UVW_POS0_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_UVW_POS0_MASK) >> QEIV2_UVW_POS_UVW_POS0_SHIFT)

/* Bitfield definition for register array: UVW_POS_CFG */
/*
 * POS_EN (RW)
 *
 */
#define QEIV2_UVW_POS_CFG_POS_EN_MASK (0x40U)
#define QEIV2_UVW_POS_CFG_POS_EN_SHIFT (6U)
#define QEIV2_UVW_POS_CFG_POS_EN_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_CFG_POS_EN_SHIFT) & QEIV2_UVW_POS_CFG_POS_EN_MASK)
#define QEIV2_UVW_POS_CFG_POS_EN_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_CFG_POS_EN_MASK) >> QEIV2_UVW_POS_CFG_POS_EN_SHIFT)

/*
 * U_POS_SEL (RW)
 *
 */
#define QEIV2_UVW_POS_CFG_U_POS_SEL_MASK (0x30U)
#define QEIV2_UVW_POS_CFG_U_POS_SEL_SHIFT (4U)
#define QEIV2_UVW_POS_CFG_U_POS_SEL_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_CFG_U_POS_SEL_SHIFT) & QEIV2_UVW_POS_CFG_U_POS_SEL_MASK)
#define QEIV2_UVW_POS_CFG_U_POS_SEL_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_CFG_U_POS_SEL_MASK) >> QEIV2_UVW_POS_CFG_U_POS_SEL_SHIFT)

/*
 * V_POS_SEL (RW)
 *
 */
#define QEIV2_UVW_POS_CFG_V_POS_SEL_MASK (0xCU)
#define QEIV2_UVW_POS_CFG_V_POS_SEL_SHIFT (2U)
#define QEIV2_UVW_POS_CFG_V_POS_SEL_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_CFG_V_POS_SEL_SHIFT) & QEIV2_UVW_POS_CFG_V_POS_SEL_MASK)
#define QEIV2_UVW_POS_CFG_V_POS_SEL_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_CFG_V_POS_SEL_MASK) >> QEIV2_UVW_POS_CFG_V_POS_SEL_SHIFT)

/*
 * W_POS_SEL (RW)
 *
 */
#define QEIV2_UVW_POS_CFG_W_POS_SEL_MASK (0x3U)
#define QEIV2_UVW_POS_CFG_W_POS_SEL_SHIFT (0U)
#define QEIV2_UVW_POS_CFG_W_POS_SEL_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_CFG_W_POS_SEL_SHIFT) & QEIV2_UVW_POS_CFG_W_POS_SEL_MASK)
#define QEIV2_UVW_POS_CFG_W_POS_SEL_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_CFG_W_POS_SEL_MASK) >> QEIV2_UVW_POS_CFG_W_POS_SEL_SHIFT)

/* Bitfield definition for register: PHASE_CNT */
/*
 * PHASE_CNT (RW)
 *
 */
#define QEIV2_PHASE_CNT_PHASE_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_PHASE_CNT_PHASE_CNT_SHIFT (0U)
#define QEIV2_PHASE_CNT_PHASE_CNT_SET(x) (((uint32_t)(x) << QEIV2_PHASE_CNT_PHASE_CNT_SHIFT) & QEIV2_PHASE_CNT_PHASE_CNT_MASK)
#define QEIV2_PHASE_CNT_PHASE_CNT_GET(x) (((uint32_t)(x) & QEIV2_PHASE_CNT_PHASE_CNT_MASK) >> QEIV2_PHASE_CNT_PHASE_CNT_SHIFT)

/* Bitfield definition for register: PHASE_UPDATE */
/*
 * INC (WO)
 *
 * set to add value to phase_cnt
 */
#define QEIV2_PHASE_UPDATE_INC_MASK (0x80000000UL)
#define QEIV2_PHASE_UPDATE_INC_SHIFT (31U)
#define QEIV2_PHASE_UPDATE_INC_SET(x) (((uint32_t)(x) << QEIV2_PHASE_UPDATE_INC_SHIFT) & QEIV2_PHASE_UPDATE_INC_MASK)
#define QEIV2_PHASE_UPDATE_INC_GET(x) (((uint32_t)(x) & QEIV2_PHASE_UPDATE_INC_MASK) >> QEIV2_PHASE_UPDATE_INC_SHIFT)

/*
 * DEC (WO)
 *
 * set to minus value from phase_cnt(set inc and dec same time willl act inc)
 */
#define QEIV2_PHASE_UPDATE_DEC_MASK (0x40000000UL)
#define QEIV2_PHASE_UPDATE_DEC_SHIFT (30U)
#define QEIV2_PHASE_UPDATE_DEC_SET(x) (((uint32_t)(x) << QEIV2_PHASE_UPDATE_DEC_SHIFT) & QEIV2_PHASE_UPDATE_DEC_MASK)
#define QEIV2_PHASE_UPDATE_DEC_GET(x) (((uint32_t)(x) & QEIV2_PHASE_UPDATE_DEC_MASK) >> QEIV2_PHASE_UPDATE_DEC_SHIFT)

/*
 * VALUE (WO)
 *
 * value to be added or minus from phase_cnt. only valid when inc or dec is set in one 32bit write operation
 */
#define QEIV2_PHASE_UPDATE_VALUE_MASK (0x3FFFFFFFUL)
#define QEIV2_PHASE_UPDATE_VALUE_SHIFT (0U)
#define QEIV2_PHASE_UPDATE_VALUE_SET(x) (((uint32_t)(x) << QEIV2_PHASE_UPDATE_VALUE_SHIFT) & QEIV2_PHASE_UPDATE_VALUE_MASK)
#define QEIV2_PHASE_UPDATE_VALUE_GET(x) (((uint32_t)(x) & QEIV2_PHASE_UPDATE_VALUE_MASK) >> QEIV2_PHASE_UPDATE_VALUE_SHIFT)

/* Bitfield definition for register: POSITION */
/*
 * POSITION (RW)
 *
 */
#define QEIV2_POSITION_POSITION_MASK (0xFFFFFFFFUL)
#define QEIV2_POSITION_POSITION_SHIFT (0U)
#define QEIV2_POSITION_POSITION_SET(x) (((uint32_t)(x) << QEIV2_POSITION_POSITION_SHIFT) & QEIV2_POSITION_POSITION_MASK)
#define QEIV2_POSITION_POSITION_GET(x) (((uint32_t)(x) & QEIV2_POSITION_POSITION_MASK) >> QEIV2_POSITION_POSITION_SHIFT)

