hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_qeiv2_regs.h
/* Bitfield definition for register: POSITION_UPDATE */
/*
 * INC (WO)
 *
 * set to add value to position
 */
#define QEIV2_POSITION_UPDATE_INC_MASK (0x80000000UL)
#define QEIV2_POSITION_UPDATE_INC_SHIFT (31U)
#define QEIV2_POSITION_UPDATE_INC_SET(x) (((uint32_t)(x) << QEIV2_POSITION_UPDATE_INC_SHIFT) & QEIV2_POSITION_UPDATE_INC_MASK)
#define QEIV2_POSITION_UPDATE_INC_GET(x) (((uint32_t)(x) & QEIV2_POSITION_UPDATE_INC_MASK) >> QEIV2_POSITION_UPDATE_INC_SHIFT)

/*
 * DEC (WO)
 *
 * set to minus value from position(set inc and dec same time willl act inc)
 */
#define QEIV2_POSITION_UPDATE_DEC_MASK (0x40000000UL)
#define QEIV2_POSITION_UPDATE_DEC_SHIFT (30U)
#define QEIV2_POSITION_UPDATE_DEC_SET(x) (((uint32_t)(x) << QEIV2_POSITION_UPDATE_DEC_SHIFT) & QEIV2_POSITION_UPDATE_DEC_MASK)
#define QEIV2_POSITION_UPDATE_DEC_GET(x) (((uint32_t)(x) & QEIV2_POSITION_UPDATE_DEC_MASK) >> QEIV2_POSITION_UPDATE_DEC_SHIFT)

/*
 * VALUE (WO)
 *
 * value to be added or minus from position. only valid when inc or dec is set in one 32bit write operation
 */
#define QEIV2_POSITION_UPDATE_VALUE_MASK (0x3FFFFFFFUL)
#define QEIV2_POSITION_UPDATE_VALUE_SHIFT (0U)
#define QEIV2_POSITION_UPDATE_VALUE_SET(x) (((uint32_t)(x) << QEIV2_POSITION_UPDATE_VALUE_SHIFT) & QEIV2_POSITION_UPDATE_VALUE_MASK)
#define QEIV2_POSITION_UPDATE_VALUE_GET(x) (((uint32_t)(x) & QEIV2_POSITION_UPDATE_VALUE_MASK) >> QEIV2_POSITION_UPDATE_VALUE_SHIFT)

/* Bitfield definition for register: ANGLE */
/*
 * ANGLE (RO)
 *
 */
#define QEIV2_ANGLE_ANGLE_MASK (0xFFFFFFFFUL)
#define QEIV2_ANGLE_ANGLE_SHIFT (0U)
#define QEIV2_ANGLE_ANGLE_GET(x) (((uint32_t)(x) & QEIV2_ANGLE_ANGLE_MASK) >> QEIV2_ANGLE_ANGLE_SHIFT)

/* Bitfield definition for register: POS_TIMEOUT */
/*
 * ENABLE (RW)
 *
 * enable position timeout feature, if timeout, send valid again
 */
#define QEIV2_POS_TIMEOUT_ENABLE_MASK (0x80000000UL)
#define QEIV2_POS_TIMEOUT_ENABLE_SHIFT (31U)
#define QEIV2_POS_TIMEOUT_ENABLE_SET(x) (((uint32_t)(x) << QEIV2_POS_TIMEOUT_ENABLE_SHIFT) & QEIV2_POS_TIMEOUT_ENABLE_MASK)
#define QEIV2_POS_TIMEOUT_ENABLE_GET(x) (((uint32_t)(x) & QEIV2_POS_TIMEOUT_ENABLE_MASK) >> QEIV2_POS_TIMEOUT_ENABLE_SHIFT)

/*
 * TIMEOUT (RW)
 *
 * postion timeout value
 */
#define QEIV2_POS_TIMEOUT_TIMEOUT_MASK (0x7FFFFFFFUL)
#define QEIV2_POS_TIMEOUT_TIMEOUT_SHIFT (0U)
#define QEIV2_POS_TIMEOUT_TIMEOUT_SET(x) (((uint32_t)(x) << QEIV2_POS_TIMEOUT_TIMEOUT_SHIFT) & QEIV2_POS_TIMEOUT_TIMEOUT_MASK)
#define QEIV2_POS_TIMEOUT_TIMEOUT_GET(x) (((uint32_t)(x) & QEIV2_POS_TIMEOUT_TIMEOUT_MASK) >> QEIV2_POS_TIMEOUT_TIMEOUT_SHIFT)



/* COUNT register group index macro definition */
#define QEIV2_COUNT_CURRENT (0UL)
#define QEIV2_COUNT_READ (1UL)
#define QEIV2_COUNT_SNAP0 (2UL)
#define QEIV2_COUNT_SNAP1 (3UL)

/* FILT_CFG register group index macro definition */
#define QEIV2_FILT_CFG_FILT_CFG_A (0UL)
#define QEIV2_FILT_CFG_FILT_CFG_B (1UL)
#define QEIV2_FILT_CFG_FILT_CFG_Z (2UL)
#define QEIV2_FILT_CFG_FILT_CFG_H (3UL)
#define QEIV2_FILT_CFG_FILT_CFG_H2 (4UL)
#define QEIV2_FILT_CFG_FILT_CFG_F (5UL)

/* UVW_POS register group index macro definition */
#define QEIV2_UVW_POS_UVW_POS0 (0UL)
#define QEIV2_UVW_POS_UVW_POS1 (1UL)
#define QEIV2_UVW_POS_UVW_POS2 (2UL)
#define QEIV2_UVW_POS_UVW_POS3 (3UL)
#define QEIV2_UVW_POS_UVW_POS4 (4UL)
#define QEIV2_UVW_POS_UVW_POS5 (5UL)

/* UVW_POS_CFG register group index macro definition */
#define QEIV2_UVW_POS_CFG_UVW_POS0_CFG (0UL)
#define QEIV2_UVW_POS_CFG_UVW_POS1_CFG (1UL)
#define QEIV2_UVW_POS_CFG_UVW_POS2_CFG (2UL)
#define QEIV2_UVW_POS_CFG_UVW_POS3_CFG (3UL)
#define QEIV2_UVW_POS_CFG_UVW_POS4_CFG (4UL)
#define QEIV2_UVW_POS_CFG_UVW_POS5_CFG (5UL)


#endif /* HPM_QEIV2_H */
